//1. Өгөгдсөн гурвалжны приметрийг ол
// const a=3;
// const b=4;
// const c=5;
// let p;
// p=a+b+c;
// console.log(p);

//2. 1, 3, 5, 7, 8.7 бүхэл тооны нийлбэрийг ол
// const numbers=[1, 3, 5, 7, 8.7];
// let sum=0;
// for (let i=0; i<numbers.length; i++)
// {
//     sum= sum + numbers[i];
// }
// console.log(sum);

//3. Өгөгдсөн тэгш өнцөгтийн талбай ба приметрийг ол. Урт=10, Өргөн=5;
// const a=10;
// const b=5;
// let p=(a+b)*2;
// let s=a*b;
// console.log(`Primetr= ${p}, Talbai= ${s}`);

//4. Өгөгдсөн 98 секунтыг минут, секунт болго
const sek = 98;
const min = 60;
let minut = sek / 60;
let sekunt = sek % 60;
console.log(minut, sekunt);

// 1. Огегдсен гурвалжны периметрийт ол.

// 2. 1,3,5,7,8.7 бухэл тооны нийлберийг ол.

// 3. Огогдсен тоги енцегтийн талбай ба
// периметрийг ол. Урт=10 Орген=5

// 4. Огогдсен 98 секундых минут секунд болго.
// болто.
// 5. Огегдсен 1297 секундыг цаг минут секунд
// шилжуул.
// 6. Отегдсен 875минут, 88секундыг, секунд РуУ
// pYY

// 1. Огогдсен 38 цагийг хоног цагт шилжуул.

// 2. Огогдсен 4хоног, 40цагийг цагт шилжуул.

// 3. Огогдсен 106 сарыг жил сар руу пилжуул.

// 4. Огогдсен 90жил, 98сарыл сард шилжуул.

// 5. Огегдсен 4 тооны багыг ол. (9 3 2 8)

// 6. Огогдсен 4 тооны 5-аас бага тоонуудын
// уржворийг ол. (2 9 4 3)

// 7. Огогдсен 6 тооны 5-аас их тоонуудын
// уржвэрийт ол. (11 9 4 3)
