// filter+reduce+map бодлого
// 1. Тэгш тоонуудын квадратын нийлбэр
// [1,2,3,4,5,6] → 2²+4²+6² = 56
const arr = [1, 2, 3, 4, 5, 6];
const oddEven= arr.map((num)=>)

// 2. 5-аас их тоонуудыг 3-аар үржүүлж нийлбэр
// [2,6,4,10] → 63 + 103 = 48
// 3. 3-аар хуваагдах тоонуудын квадратын нийлбэр
// [3,4,6,7,9] → 3²+6²+9² = 126
// 4. 10-аас бага тоонуудын кубын нийлбэр
// [2,5,12,7] → 2³+5³+7³ = 470
// 5. 0-с их тоонуудыг 2 дахин үржүүлж нийлбэр
// [-2,3,0,5,-1] → (32 + 52) = 16
// 6. 2-аар хуваагдах тоонуудын дундаж
// [2,5,8,10] → (2+8+10)/3 = 6.666…
// 7. 3-аар хуваагдах тоонуудын дундаж
// [3,4,6,7,9] → (3+6+9)/3 = 6
// 8. 5-аас их тоонуудыг модуль 2 үр дүнгээр шүүх, нийлбэр олох
// [2,6,4,10,7] → 6+4+10 = 20
// 9. 3-аас бага тоонуудын үржвэр
// [1,2,3,4,5] → 1*2 = 2
// 10. 5-аас бага тоонуудын квадратын нийлбэр
// [1,2,3,6,7] → 1²+2²+3² = 14
// 11. 10-аас их тоонуудын квадратын нийлбэр
// [5,12,8,20,3] → 12² + 20² = 544
// 12. Тэгш тоонуудын кубын нийлбэр
// [1,2,3,4,5,6] → 2³+4³+6³ = 288
// 13. 3-аар хуваагдах тоонуудын кубын нийлбэр
// [3,4,6,7,9] → 3³+6³+9³ = 972
// 14. 0-с их тоонуудын квадратын нийлбэр
// [-5,0,4,7,-1] → 4²+7² = 65
// 15. 10-аас их тоонуудыг 2 дахин үржүүлж нийлбэр
// [8,12,15,5] → 122 + 152 = 54
// 16. 5-аас их тоонуудын модуль 3 үр дүнг нийлүүлэх
// [2,6,4,10,7] → 6%3 + 10%3 = 0+1 = 1
// 17. 5-аас бага тоонуудын модуль 2 үр дүнг нийлүүлэх
// [1,2,3,6,7] → 1%2 + 2%2 + 3%2 = 1+0+1 = 2
// 18. 3-аар хуваагдах тоонуудын квадратын нийлбэрийг мод 10
// [3,4,6,7,9] → (3²+6²+9²)%10 = 126%10 = 6
// 19. 10-аас их тоонуудын квадратын нийлбэрийг мод 7
// [5,12,8,20,3] → (12² + 20²)%7 = 544%7 = 5
// 20. String массив: 5 үсгээс урт үгсийг filter → map → reduce ашиглан нийт урт
// ["hi","hello","hey","world","javascript"] → hello+world+javascript = 5+5+10=20
